In [1]:
import pandas as pd
import numpy as np

In [2]:
mtx=[[690,3.1,9,7,4]
    ,[590,3.9,7,6,10]
    ,[600,3.6,8,8,7]
    ,[620,3.8,7,10,6]
    ,[700,2.8,10,4,6]
    ,[650,4.0,6,9,8]]

In [3]:
w=[0.3,0.2,0.2,0.15,0.15]

In [4]:
Names=['Alfred','Beverly','Calvin','Diana','Edward','Frank']

In [5]:
##Step 1
Data=pd.DataFrame(mtx,index=Names)
Data

           0    1   2   3   4
Alfred   690  3.1   9   7   4
Beverly  590  3.9   7   6  10
Calvin   600  3.6   8   8   7
Diana    620  3.8   7  10   6
Edward   700  2.8  10   4   6
Frank    650  4.0   6   9   8

In [6]:
## Step 2
Data_norm = Data/np.sqrt(np.power(Data,2).sum(axis=0))
Data_norm

                0         1         2         3         4
Alfred   0.438053  0.355454  0.462299  0.376322  0.230556
Beverly  0.374567  0.447184  0.359566  0.322562  0.576390
Calvin   0.380916  0.412785  0.410932  0.430083  0.403473
Diana    0.393613  0.435718  0.359566  0.537603  0.345834
Edward   0.444402  0.321055  0.513665  0.215041  0.345834
Frank    0.412659  0.458650  0.308199  0.483843  0.461112

In [7]:
##Step 3
Data_norm_w=Data_norm*w
Data_norm_w

                0         1         2         3         4
Alfred   0.131416  0.071091  0.092460  0.056448  0.034583
Beverly  0.112370  0.089437  0.071913  0.048384  0.086459
Calvin   0.114275  0.082557  0.082186  0.064512  0.060521
Diana    0.118084  0.087144  0.071913  0.080640  0.051875
Edward   0.133321  0.064211  0.102733  0.032256  0.051875
Frank    0.123798  0.091730  0.061640  0.072576  0.069167

In [8]:
Data_norm_w.max()

0    0.133321
1    0.091730
2    0.102733
3    0.080640
4    0.086459
dtype: float64

In [9]:
Data_norm_w.min()

0    0.112370
1    0.064211
2    0.061640
3    0.032256
4    0.034583
dtype: float64

In [10]:
##Step 4
positive_ideal = Data_norm_w.max()
negative_ideal = Data_norm_w.min()

In [11]:
##Step 5
SM_P = np.sqrt(np.power(Data_norm_w-positive_ideal,2).sum(axis=1))
##negative
SM_N = np.sqrt(np.power(Data_norm_w-negative_ideal,2).sum(axis=1))

In [12]:
np.sqrt(np.power(Data_norm_w-positive_ideal,2).sum(axis=1))

Alfred     0.061737
Beverly    0.049341
Calvin     0.042449
Diana      0.048980
Edward     0.065531
Frank      0.046297
dtype: float64

In [13]:
np.sqrt(np.power(Data_norm_w-negative_ideal,2).sum(axis=1))

Alfred     0.044104
Beverly    0.060770
Calvin     0.049755
Diana      0.057482
Edward     0.049260
Frank      0.060907
dtype: float64

In [14]:
SM_N/(SM_N+SM_P)

Alfred     0.416704
Beverly    0.551900
Calvin     0.539620
Diana      0.539926
Edward     0.429128
Frank      0.568142
dtype: float64